const express = require('express');
const cors = require('cors');
const server = express();
const PORT = 9999;

server.use(express.static(__dirname));
server.use(cors());
server.use(express.json());

const movies = [
  { 
    id: 1,
    title: 'Диявол носить "Прада"',
    year: 2006,
    poster: "/images/posters/the-devil-wears-prada.jpg",
    plot: "Юна Енді Сакс, провінційна журналістка з великими амбіціями, скромним досвідом і бажанням публікуватися в «Нью-Йоркському» медіа, отримує роботу в модному глянцевому «Подіумі». Дівчині належить стати асистенткою головного редактора Міранди Прістлі - великої і жахливої ​​законодавиці світу моди, що приводить в священний трепет модельєрів, фотографів і редакторів.",
    director: "Девід Франкель",
    actors: ["Меріл Стріп", "Енн Гетевей", "Емілі Блант", "Стенлі Туччі", "Саймон Бейкер", "Едріан Ґреньє"],
    genre: ["Комедія" , "Драма"]
  },
  { 
    id: 2,
    title: "Білявка в законі",
    year: 2001,
    poster: "/images/posters/legally-blonde-poster.png",
    plot: "Посеред ідеального побачення в дорогому ресторані хлопець Ел прямим текстом заявив їй, що вона не достатньо серйозна і не найкраща партія для такого вартого заздрості нареченого як він, і поїхав вчитися в Гарвард, залишивши експодружку. Досхочу наплакавшись, Ел прийшла до висновку, що зможе повернути Ворнера, якщо покаже, що здатна досягти тих самих результатів, що й він, і, набравши необхідну кількість балів на вступному тесті до юридичного факультету, поїхала слідом за коханим.",
    director: "Роберт Лукетич",
    actors: ["Різ Візерспун", "Люк Вілсон", "Сельма Блер", "Меттью Девіс"],
    genre: ["Комедія"]
  },
  { 
    id: 3,
    title: "Барбі",
    year: 2023,
    poster: "/images/posters/barbie-poster.jpg",
    plot: "Барбі занурюється у глибоку кризу, яка потрясає основи її світу і ставить екзистенційні питання про її власне існування. Зіткнувшись із невизначеністю та глибоким самоаналізом, вона вирушає в подорож, щоб розгадати таємниці, які лежать під поверхнею її ідеального світу, і врешті-решт знайти відповіді, які можуть переосмислити її розуміння себе та реальності, в якій вона живе.",
    director: "Ґрета Ґервіґ",
    actors: ["Марго Роббі", "Райан Гослінг", "Америка Феррера", "Аріана Грінблатт", "Кейт МакКіннон", "Ісса Рей", "Рі Перлман", "Вілл Феррелл", "Майкл Сера"],
    genre: ["Комедія", "Фентезі"]
  },
  { 
    id: 4,
    title: "Щоденники принцеси",
    year: 2001,
    poster: "/images/posters/the-princess-diaries-poster.jpg",
    plot: "Життя Мії різко змінюється, коли вона дізнається, що є спадкоємицею престолу маленького європейського князівства під назвою Женовія. Її бабуся, королева Кларисса Ренальді, приїжджає до Сан-Франциско, щоб повідомити Мії про її королівську спадщину. Батько Мії був принцом Женовії, що робить її принцесою за правом народження.\nСпочатку приголомшена цим одкровенням, Мія вагається, чи прийняти свою нову роль принцеси. Вона проходить трансформацію під керівництвом своєї бабусі, яка дає їй уроки етикету, грації та королівських манер. Зовнішність Мії також зазнає змін, і вона починає пристосовуватися до вимог свого нового життя.",
    director: "Гаррі Маршалл",
    actors: ["Енн Гетевей", "Джулія Ендрюс", "Гектор Елізондо", "Менді Мур"],
    genre: ["Комедія"]
  },
  {
    id: 5,
    title: "Людина, яка пізнала нескінченність",
    year: 2015,
    poster: "/images/posters/the-man-who-knew-infinity-poster.jpg",
    plot: "Срініваса Рамануджан, вихований у бідній родині з індійського міста Мадраса, отримав запрошення на навчання в Кембриджському університеті. Поки Європа палала у вогні Першої світової війни, він досяг успіхів у розвитку математичних досліджень під керівництвом професора, Ґодфрі Гарольд Гарді.",
    director: "Метью Браун",
    actors: ["Дев Пател", "Джеремі Айронс", "Тобі Джонс", "Стівен Фрай", "Кевін Макнеллі", "Энцо Чіленті"],
    genre: ["Драма", "Біографія"]
  },
  {
    id: 6,
    title: "Той, що біжить лабіринтом",
    year: 2014,
    poster: "/images/posters/the-maze-runner-poster.jpg",
    plot: "Томас прокидається в підіймачі, не пам’ятаючи нічого про своє минуле. Він опиняється у закритій зоні, відомій як Галявина, де вже кілька років живуть інші підлітки. Галявина оточена величезним Лабіринтом, що змінюється щоночі, і населений смертельно небезпечними механічними створіннями – Гриверами. Мешканці Галявини створили власне суспільство, встановивши правила для виживання.Томас разом із друзями має розгадати таємницю Лабіринту, з’ясувати, хто створив це випробування, і знайти спосіб вибратися на волю.",
    director: "Вес Болл",
    actors: ["Амл Амін", "Кі Хонг Лі", "Блейк Купер", "Томас Броді-Санґстер", "Вілл Поултер", "Кая Скоделаріо"],
    genre: ["Екшн", "Детективи", "Трилери", "Фантастика", "Антиутопія"]
  },
  {
    id: 7,
    title: "Дивергент",
    year: 2014,
    poster: "/images/posters/divergent-poster.jpg",
    plot: "Світ майбутнього, у ньому суспільство поділено на 5 фракцій, виходячи з рис людини: Щирість, Альтруїзм (Зречення), Безстрашність, Дружелюбність, Ерудиція. Досягнувши 16 років, кожен підліток проходить тест, яким визначається, у якій фракції людина перебуватиме до кінця свого життя. Беатрис Прайер — шістнадцятирічна дівчина з сім'ї Альтруїзму не отримує остаточного результату, тому що вона є Дивергентом — людиною, що не може належати лише до однієї фракції й на думку влади міста загрожує повстанням і зрушенням побудованої системи Фракцій. Трис робить несподіваний для всіх вибір, який цілковито змінює її майбутнє, її саму і несе за собою нестримний потік пригод.",
    director: "Ніл Берґер",
    actors: ["Шейлін Вудлі", "Тео Джеймс", "Ансель Елґорт", "Рей Стівенсон", "Кейт Вінслет"],
    genre: ["Бойовик", "Пригоди", "Романтика", "Наукова фантастика", "Антиутопія", "Постапокаліпсис"]
  },
  {
    id: 8,
    title: "Голодні ігри",
    year: 2014,
    poster: "/images/posters/hunger-games-poster.jpg",
    plot: "Держава Панем, розміщена у постапокаліптичній Північній Америці, складається із заможного Капітолію та дванадцятьох бідніших районів, так званих «округів». Як покарання за минуле повстання проти Капітолію, кожного року через лотерею округи обирають одного хлопця і одну дівчину віком від 12 до 18 років для участі у Голодних іграх. Обрані, «трибути», мають битися між собою на контрольованій Капітолієм арені, доки живим залишиться лише один із них. Нагорода за перемогу — слава та багатство. Катніс Евердін, 16-річна дівчина з Округу 12 добровільно зголошується піти на 74-ті Голодні ігри замість своєї молодшої сестри Прим, на котру вказав жереб. Піта Мелларк, син пекаря, який одного разу врятував її сім'ю від голоду, також обраний.\nКатніс та Піта забирають до Капітолію, де колишній переможець ігор Геймітч Абернаті, інструктує їх, як вижити. У перший же день, коли стартують Голодні ігри, половину трибутів убивають. Тим часом Катніс застосовує свої добре відпрацьовані під час полювань вміння, щоб вижити.",
    director: "Ґері Росс",
    actors: ["Дженніфер Лоренс", "Джош Гатчерсон", "Ліам Гемсворт", "Вуді Гаррельсон", "Елізабет Бенкс", "Ленні Кравіц", "Стенлі Туччі", "Дональд Сазерленд"],
    genre: ["Бойовик", "Наукова фантастика", "Антиутопія", "Драма"]
  },
  { 
    id: 9,
    title: 'Оппенгеймер',
    year: 2023,
    poster: "/images/posters/oppenheimer-poster.png",
    plot: "У розпал Другої світової війни полковник США Леслі Гровс призначає блискучого фізика-теоретика Роберта Оппенгеймера науковим керівником Манхеттенського проєкту. Вся індустріальна міць та інноваційні технології країни йдуть на те, щоб випередити нацистську Німеччину у створенні зброї масового знищення на основі розщеплення ядра атома. Оппенгеймер проводить успішні випробування першої у світі ядерної бомби, що дозволяє наблизити перемогу у війні. Проте чоловіка мучать докори совісті, оскільки його винахід здатний призвести до знищення всього людства...",
    director: "Крістофер Нолан",
    actors: ["Кілліан Мерфі", "Емілі Блант", "Метт Деймон", "Роберт Дауні мол", "Флоренс П'ю", "Джош Гартнетт", "Кейсі Аффлек", "Рамі Малек", "Кеннет Брана", "Бенні Сефді"],
    genre: ["Історичний", "Біографія", "Драма", "Фільм-трилер", "Епічний фільм"]
  },
  { 
    id: 10,
    title: 'Ігри розуму',
    year: 2001,
    poster: "/images/posters/abeautiful-mind-poster.jpg",
    plot: "У кінофільмі «Ігри розуму» показано життя реально існуючого вченого, лауреата премії миру.\nДжонатан Неш - блискучий вчений, вже в юності виявляв неабиякі здібності до математики, і зробив в цій науці прорив. У нього пристрасть до вирішення кодів і найскладніших математичних задач, але спеціальністю Неша стала теорія ігор, що завдяки цій людині стало зовсім іншою областю.\nАле і це не найдивніше. Одного разу доля підносить Нешу удар, який йому належить тримати все життя ...",
    director: "Рон Говард",
    actors: ["Рассел Кроу", "Ед Гарріс", "Дженніфер Коннеллі", "Крістофер Пламмер", "Пол Беттані", "Адам Голдберг"],
    genre: ["Біографія", "Драма"]
  },
    { 
    id: 11,
    title: 'Сутінки',
    year: 2008,
    poster: "/images/posters/twilight-poster.jpg",
    plot: "Молода дівчина Ізабелла Свон переїжджає до свого батька в похмуре містечко, де закохується в молодого юнака Едварда Каллена. Юнак відповідає їй взаємністю, але виявляється, що він, як і вся його сім'я, вампір. Чесно попередивши її про цей діагноз, він наполягає на розриві стосунків. Дівчина проявляє наполегливість./nТим часом у місті з'являються старі вороги сімейства Едварда і Белла опиняється в небезпеці./nДо речі, актори, які грали у фільмі вампірів, підписали контракт, що забороняє їм перебування на сонці - для збереження блідості.",
    director: "Кетрін Гардвік",
    actors: ["Крістен Стюарт", "Роберт Паттінсон", "Біллі Берк", "Пітер Фачінеллі"],
    genre: ["Історичний", "Біографія", "Драма"]
  },
  { 
    id: 12,
    title: 'Оппенгеймер"',
    year: 2023,
    poster: "/images/posters/oppenheimer-poster.png",
    plot: "У розпал Другої світової війни полковник США Леслі Гровс призначає блискучого фізика-теоретика Роберта Оппенгеймера науковим керівником Манхеттенського проєкту. Вся індустріальна міць та інноваційні технології країни йдуть на те, щоб випередити нацистську Німеччину у створенні зброї масового знищення на основі розщеплення ядра атома. Оппенгеймер проводить успішні випробування першої у світі ядерної бомби, що дозволяє наблизити перемогу у війні. Проте чоловіка мучать докори совісті, оскільки його винахід здатний призвести до знищення всього людства...",
    director: "Крістофер Нолан",
    actors: ["Кілліан Мерфі", "Емілі Блант", "Метт Деймон", "Роберт Дауні мол", "Флоренс П'ю", "Джош Гартнетт", "Кейсі Аффлек", "Рамі Малек", "Кеннет Брана", "Бенні Сефді"],
    genre: ["Історичний", "Біографія", "Драма"]
  },
];


const users = [
  { username: 'john', password: 'password123' },
  { username: 'alice', password: 'password456' }
];

const quotes = [
  {
    text: "Елементарно, мій дорогий Ватсон",
    movie: "Пригоди Шерлока Холмса (Шерлок Холмс)"
  },
    {
    text: "Я — король світу!",
    movie: "Титанік (Леонардо Ді Капріо)"
  },
    {
    text: "Ніколи не поспішайте. Ви пропустите найкращі частини в житті",
    movie: "Навколо світу за вісімдесят днів"
  },
    {
    text: "Лови момент. Ловіть момент, хлопці. Зробіть своє життя надзвичайним",
    movie: "Товариство мертвих поетів (Джон Кітінг)"
  },
  {
    text: "Тримай друзів близько, а ворогів ще ближче",
    movie: "Хрещений батько, частина друга"
  },
  {
    text: "Х'юстон, у нас проблема",
    movie: "Аполлон-13"
  },
  {
    text: "Той, хто шукає, знаходить",
    movie: "В пошуках Немо"
  },
];

server.get('/movies', function (req, res) {
  res.json(movies);

});

function findUser(users, username, password) {
    for (let i = 0; i < users.length; i++) {
    let u = users[i];
    if (u.username === username && u.password === password) {
      return u;
    }
  }
}

server.post('/login', function (req, res) {
  const { username, password } = req.body;

  const user = findUser(users, username, password);
  if (user) {
    return res.status(200).json({ success: true, message: 'Ви успішно увійшли до акаунту!' });
  } else {
    return res.status(401).json({ success: false, error: 'Неправильний логін або пароль' });
  }
});

server.get('/quote', function (req, res) {
  const randomIndex = Math.floor(Math.random() * quotes.length);
  res.json(quotes[randomIndex]);
});

server.listen(PORT, () => {
  console.log('Server is running on port ' + PORT);
});